'''Лабораторная работа №1
Написать программу, которая читая символы из бесконечной последовательности (эмулируется конечным файлом, читающимся поблочно), распознает, преобразует и выводит на экран лексемы по определенному правилу. Лексемы разделены пробелами. Преобразование делать по возможности через словарь. Для упрощения под выводом числа прописью подразумевается последовательный вывод всех цифр числа. Регулярные выражения использовать нельзя.
Вариант 20.
Нечетные двоичные числа, не превышающие 204810, в которых встречается ровно одна серия из двух подряд идущих единиц. Выводит на экран цифры числа, исключая единицы. Отдельно выводится прописью номер позиции, с которой начинается эта серия.
'''
while True:
    print("Выберите файл: test1.txt, test2.txt, test3.txt или 'Exit'")
    line = input()
    if line != 'test1.txt' and line != 'test2.txt' and line != 'test3.txt' and line != 'Exit':
        print("Ввели некорректную команду, попробуйте еще раз")
        continue
    if line == 'Exit':
        break
    file = open(line, 'r')

    for i in file:
        index = 0
        line = i.rstrip()
        if line.count('11') == 1:
            index = line.index('11')
            output = line[:index] + line[index + 2:]
            if len(output) != 0:
                print(output, end=' ')
            else:
                print("Убрали все символы", end=' ')
            print(index)
        else:
            continue
    print()
